02_Droplet_2d/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       1740;
    }
    atmosphere
    {
        type            patch;
        nFaces          60;
        startFace       1800;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1800;
        startFace       1860;
    }
)

// ************************************************************************* //
